<template>
    <div class="agreement">
        <h2>全耀装修社区服务平台商户入驻服务合同</h2>
        <p style="font-weight: bold">
           甲方：拟进入平台开展相关经营活动的商户（服务提供者）
        </p>
        <p style="font-weight: bold">
            乙方：上海静美网络科技有限公司
        </p>
        <p>
            根据《中华人民共和国合同法》及相关法律、法规的规定，甲乙双方经友好协商，经友好协商后，就甲方通过我平台展开经营活动，缔结本合同，内容如下：
        </p>
        <h4>第一条 定义条款</h4>
        <p style="text-indent:2em;">1.1 全耀装修社区服务平台：指由乙方管理和运营的网络交易服务平台，提供交易、预定服务、帮助甲方品牌宣传等等服务，包括但不限于全耀装修社区服务平台移动应用客户端、移动应用商户端、网页端、乙方自媒体平台、乙方关联方、乙方合作方运营或管理的网络服务平台，及未来可能新设或合作的网络平台等。</p>
        <p style="text-indent:2em;">
            1.2 团购：指甲方通过全耀装修社区服务平台发布产品和服务信息，平台用户（以下简称“用户”）自行下订单购买。
        </p>
        <p style="text-indent:2em;">
           1.3 团购价：指甲方通过全耀装修社区服务平台所发布产品服务信息，用户购买时实际支付的销售单价。
        </p>
        <p style="text-indent:2em;">
           1.4 买单优惠：指甲方在平台发布的产品服务信息，用户直接在平台通过此方式进行支付，并享受一定折扣的实际性优惠服务。
        </p>
        <p style="text-indent:2em;">
            1.5 买单优惠价：用户通过平台买单优惠方式购买甲方产品和服务时，用户实际支付的销售单价。
        </p>
        <p style="text-indent:2em;">
            1.6 甲方信息：指甲方向平台提供和发布的所有信息，包括但不限于资质、团购产品信息、买单优惠产品等信息。
        </p>
        <p style="text-indent:2em;">
            1.7 平台维护建设费：乙方为甲方提供的服务，甲方应向乙方支付的服务费总称。
        </p>
        <h4>第二条 全耀装修社区服务平台的服务</h4>
        <p style="text-indent:2em;">
            2.1 乙方通过平台，为甲方提供团购技术服务、买单优惠服务、以及其他有利于甲方品牌宣传和经营的相关服务。
        </p>
        <p style="text-indent:2em;">
            2.2 双方约定的其他有偿服务（如有将另行约定）。
        </p>
        <h4>第三条 服务费用和支付方式</h4>
        <p style="text-indent:2em;">
           基于乙方服务，甲方应按约定向乙方支付服务费，甲方同意并确认，乙方/乙方关联方/乙方合作方于代收款总额中直接扣除上述服务费后，将代收额支付给甲方。
        </p>
        <h4>第四条 甲方权利及义务</h4>
        <p style="text-indent:2em;">
           4.1 甲方应向乙方提供真实有效的合法经营资质文件，证明其通过乙方平台开展团购活动、优惠券及其它经营性业务的合法性，甲方应保证对所提交资质主体的合法真实性和有效性承担全部责任，若因甲方提供资质出现虚假、失效、缺失等产生法律责任的，由甲方独立自行承担所有责任。甲方也应予以提供资料包括但不限于甲方营业执照、行业许可证文件，如涉及特殊行业需要特定的资质或许可文件。甲方因提供资质的信息问题而致使本合同无法正常履行的，由此产生的一切结果由甲方负责，甲方还需赔偿乙方/乙方关联方/乙方合作方因此遭受的损失。
        </p>
        <p style="text-indent:2em;">
           4.2 （1）甲方应保证向乙方提供和发布的团购信息、商品/服务说明、信息文案所需资料（包含素材、图片、文字说明、门店、商家介绍、价格）的合法、有效和真实性，不存在侵权和虚假；<br>
           （2）甲方承诺在乙方平台发布的的团购信息、商品/服务说明、信息文案所需资料（包含素材、图片、文字说明、门店、商家介绍、价格）等信息的著作权没有侵犯任何第三方的权益；<br>
           （3）甲方承诺委托乙方代为拍摄和发布的产品图片、变价、发布的团购信息和发布的其他产品信息等，不会因原始素材问题侵犯任何第三方权益；<br>
           （4）若甲方是通过指定某第三方平台（包括乙方同业竞争平台），同时甲方委托乙方/乙方关联方/乙方合作方将甲方指定的某第三方平台的团购信息、商品/服务说明和信息文案所需资料（包含素材、图片、文字说明、门店、商家介绍、价格）复制或修改后上传至乙方服务平台，甲方承诺并保证对其使用、委托和同意上传的商品、商标、品牌、图片、文字等产品信息享有合法权利，不会侵犯他人的知识产权、著作权和企业名称权等权益。甲方承诺和保证因违反这四条而产生的一切结果由甲方负责，且甲方承诺乙方/乙方关联方/乙方合作方不会因此而遭受来自任何第三方的投诉、抗辩及争议，否则相应责任均由甲方承担，且甲方还需赔偿乙方/乙方关联方/乙方合作方因此遭受的损失。
        </p>
        <p style="text-indent:2em;">
            4.3 甲方许可乙方在合同目的下及不损害甲方利益的情况下有权使用甲方在乙方平台上所提供和发布的以上所有产品信息资料使用权，从而帮助甲方提供更有效的服务。
        </p>
        <p style="text-indent:2em;">
            4.4甲方应妥善保管全耀装修社区服务平台账号及密码，通过甲方账号在平台上进行的行为均被视为甲方的行为，若因账号或密码丢失或保管不善造成损失的，由甲方举证并承担不利后果。
        </p>
        <p style="text-indent:2em;">
            4.5用户通过平台提交订单购买甲方提供的服务产品，订单提交并付款成功，则用户与甲方之间的买卖或服务合同成立，甲方应按照本合同约定，甲方信息描述、订单及乙方相关规则接受用户的预约和消费。因甲方原因造成的用户投诉、经济损失等相关后果均由甲方承担，乙方有权解除合同，在代收额中扣除上述行为给乙方/乙方关联方/乙方合作方造成的损失，并要求甲方按照本合同约定支付违约金。
        </p>
        <p style="text-indent:2em;">
            4.6在合同期内，因甲方原因造成的方案、项目或合同中止甲方应及时通知乙方。若因店面装修、停业整顿、破产或其他原因下线，应提前10个工作日通知乙方，并按照约定对下线前已购买团购产品的用户提供团购产品。若停止经营经营应至少提前10个工作日通知乙方并提出善后方案。未通知停止经营、提前下线或不接待客户产生任何纠纷的，乙方有权解除合同，在代收额中扣除上述行为给乙方/乙方关联方/乙方合作方造成的损失，并要求甲方按照本合同约定支付违约金。
        </p>
        <p style="text-indent:2em;">
            4.7 甲方应按照平台价为用户开具同等金额发票。
        </p>
        <p style="text-indent:2em;">
            4.8 甲方承诺合作项目或类似项目产品在其他平台、线下销售和其他任何渠道销售时，价格不得低于本合同所涉及平台价，否则乙方有权解除合同。
        </p>
        <p style="text-indent:2em;">
            4.9甲方保证不以任何手段唆使消费者放弃全耀装修社区服务平台而购买其他团购平台的产品、改用现金或其他方式消费。
        </p>
        <p style="text-indent:2em;">
            4.10 乙方在平台开展市场活动和其他任何情况下，甲方不得利用和进行任何虚假交易（指有线上交易记录线下未提供实际服务或产品的行为）获取不正当利益，当出现此情况时，乙方有权暂停结算并要求甲方提供接待消费者证明（如备货单、消费小票等），甲方无法提供有效接待凭证的，乙方有权解除合同，在代收额中扣除上述行为给乙方/乙方关联方/乙方合作方造成的损失，并要求甲方按照本合同约定支付违约金。
        </p>
        <p style="text-indent:2em;">
            4.11 用户通过平台发布的针对甲方的评论、照片等，纯属用户个人意见，与乙方立场无关，乙方不承担任何责任。
        </p>
        <p style="text-indent:2em;">
           4.12 甲方若没合法或按本合同约定经营，如因甲方行为或甲方提供的商品/服务造成用户损失的，由甲方承担相应的赔偿责任，在纠纷解决之前，乙方有权暂停与甲方结算，直至相应纠纷解决完毕。如乙方/乙方关联方/乙方合作方基于前述情况向消费者先行赔付的，乙方有权进行追偿。
        </p>
        <h4>第五条 乙方权利及义务</h4>
        <p style="text-indent:2em;">
           5.1 乙方应按合同规定向甲方提供服务，并对交易平台的相关功能进行升级和改进，一提高用户及甲方使用体验。对于乙方新增的功能，甲方有权按照乙方的规则使用。
        </p>
        <p style="text-indent:2em;">
            5.2为更好的推荐甲方及其商品/服务，以提升甲方的知名度/订单量，乙方可通过适当的方式和渠道做相关宣传介绍，并进行相关推荐/推广。甲方对上述行为予以认可，并授权乙方/乙方关联方/乙方合作方就甲方及其相关门店的名称、LOGO、图片、文字、门店、会员优惠等信息进行使用。
        </p>
        <p style="text-indent:2em;">
            5.3 乙方制定和修改各项服务规则，对涉及商户权利和义务的修改或调整，乙方应提前7天在平台上予以公示，若甲方不同意平台的相关服务规则，应以书面加盖公章方式通知乙方，乙方会选择终止相关变更或终止向商户提供服务，如相关规则生效后，甲方继续使用平台服务将视为甲方接受新发布或修改后的规则。
        </p>
        <p style="text-indent:2em;">
            5.4 乙方有权对甲方拟在平台发布的内容、信息进行形式审核，必要时乙方有权依据法律法规、政策规定及平台规则予以删改或拒绝发布。
        </p>
        <p style="text-indent:2em;">
            5.5 乙方有权开展相关营销推广活动（包括输出团购信息至其他平台）。在不改变与甲方的结算价的情况下，单方更改团购价，并将甲方团购产品纳入营销范围，甲方对此不持异议。
        </p>
        <h4>第六条 违约责任</h4>
        <p style="text-indent:2em;">
            6.1除非本合同另有约定，如甲方违反其在本合同的履行中做出的任何承诺和保证，或甲方提供的资质、证照等信息不属实，则乙方及其关联方有权停止向甲方支付代净额，并有权要求甲方在一定期限内纠正违约行为。如甲方在乙方要求的期限内纠正违约行为后符合本合同约定的，乙方应恢复向甲方支付代收额；如甲方在乙方要求的期限内拒绝纠正或纠正后仍不符合本合同约定的，乙方有权单方解除本合同，并有权要求甲方按照本合同生效之日起累计至甲方发生违约行为之日的收益总额的30%向乙方支付违约金。
        </p>
        <p style="text-indent:2em;">
            6.2因乙方未能按照合同约定履行义务包括未及时付款，且在甲方要求的期限内拒绝纠正或纠正后仍不符合本合同约定的，应承担因此给甲方造成的损失。
        </p>
        <h4>第七条 责任免除</h4>
        <p style="text-indent:2em;">
            因战争，自然灾害、网络通信故障，政府行为、电网断电等不可抗力导致本合同无法履行的，双方互不承担违约责任。
        </p>
        <h4>第八条 合同终止、解除和续签</h4>
        <p style="text-indent:2em;">
           8.1 本合同终止前甲方已与用户达成的尚未履行完毕的订单，甲方应按照本合同、甲方信息及订单、平台规则等的约定继续履行相应义务。
        </p>
        <p style="text-indent:2em;">
            8.2 本合同期届满时，若甲乙双方没有提前10日提出合同终止，则双方均默认本合同按原合同内容条款和合同期限自动顺延和续约，自动续约合同与原合同保持一致，拥有同等法律效力。
        </p>
        <p style="text-indent:2em;">
            8.3甲方存在欺诈经营、并经用户举报投诉且证据确凿的，本合同立即终止，平台立即下架甲方的信息资料，甲方并承担由此带来的一切后果。
        </p>
        <h4>第九条 保密协议</h4>
        <p style="text-indent:2em;">
            9.1 双方应对合作事宜和对方相关信息进行保密，不得向任何第三方透露，保密期限包括合同终止后，否则违约方应承担给对方带来的损失和影响。
        </p>
        <h4>第十条 反商业贿赂</h4>
        <p style="text-indent:2em;">
            若甲方向乙方人员提供任何酬金、礼物或其他有形或无形利益，均视为商业贿赂行为，一经发现乙方有权单方解除合同并有权要求甲方支付人民币伍万元作为违约金。若遇乙方人员主动索贿的，甲方有权向乙方监察部门举报。
        </p>
        <h4>第十一条 合同争议解决方案</h4>
        <p style="text-indent:2em;">
            凡因本合同或与本合同有关的一切争议，由甲乙双方共同协商，如协商不成提交本合同签订地人民法院管辖。
        </p>
        <h4>第十二条 合同附则</h4>
        <p style="text-indent:2em;">
            12.1 本合同附件与本合同不可分割，拥有同等法律效力。
        </p>
        <p style="text-indent:2em;">
            12.2 双方不得涂改本合同，涂改部分无效，双方任何口头协议均属无效。
        </p>

    </div>
</template>

<style lang="scss" scoped>
@import '@/assets/styles/global.scss';
.agreement {
    padding: px2rem(20);
    text-align: justify;
    justify-content: initial;
    font-size: 16px;
    h2{
        font-size: 18px;
        text-align: center;
        margin-bottom: px2rem(20);
    }
    p{
        line-height: 18px;
        margin-bottom: px2rem(20);
    }
    h4{
        font-weight: bold;
        margin-bottom: px2rem(10);
    }
    
}
</style>
